const array = [
  'Мат.Логика (Прак) Пупышев В.В. 410а/6к',
  "Сис.программирование (Лаб) Трусов А.С. 317/6к",
  "БЖД (Прак) Римшина А.А. 504/6к",
  "СЛПР (Лек) Шрейбер Т.В. 319/1к",
  "СЛПР (Прак) Шрейбер Т.В. 311/6к",
  "БЖД (Лек) Мерзлякова Д.Р. 319/6",
  "Дифф.Уры (Прак) Новикова Е.В 410а/6к",
  "Технологии обр. информации (Лек) Поярков А.В 319/1к",
  "Сис.программирование (Лаб) Трусов А.С. 317/6к",
  "Дифф.Уры (Лек) Новикова Е.В 307/1к",
  "Физра Харин А.А",
  "Мат.Логика (Лек) Яшин А.Д 319/1к",
  "Компьютерная графика (Лек) Клочков М.А. 319/1к",
  "Физика (Лек) Жданова Л.И. 307/1к",
  "Физра Харин А.А",
  "Введение в синт.анализ (Лаб) Дюгуров Д.В 311/6к",
  "Введение в синт.анализ (Лек) Дюгуров Д.В 421/6к",
  "БД (Лек) Анисимов А.Е 307/1к",
  "Философия (Лек) Щадрин А.А. 229/1к",
  "Компьютерная графика (Лаб) Клочков М.А. 321/6к",
  "БД (Лаб) Логов А.Г. 317/6к",
  "Основы управления проектами (Лек) Лашкарев А.Н. 421/6к",
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
  'Пары нет',
];

let day = 1;
let lesson = 1;
let group_id = 1;

/* 
const interval = setInterval(() => {
  const cTop = array[Math.round(Math.random() * array.length)];
  const cDown = array[Math.round(Math.random() * array.length)];
  if(cTop === null && cDown === 'Пары нет') cDown = null;
  if(cTop === 'Пары нет' && cDown === null) cTop = null;
  if(cTop === 'Пары нет' && cDown === 'Пары нет') {
    cTop = null;
    cDown = null;
  }
  if(cTop === null && cDown !== 'Пары нет' && cDown !== null) cTop = 'Пары нет';
  if(cDown === null && cTop !== 'Пары нет' && cTop !== null) cDown = 'Пары нет';
  fetch(`http://dashboard/api/index.php/?method=gerenerateDay&day=${day}&lesson=${lesson}&group_id=${group_id}&top=${cTop}&down=${cDown}`);
  lesson++;
  if(lesson === 6){
    lesson = 1;
    day++;
    if(day === 7){
      day = 1;
      group_id++;
      if(group_id === 5) clearInterval(interval);
    }
  }
}, 1000); */